[["", "https://m.economictimes.com/news/international/world-news/another-mahinda-rajapaksa-loyalist-held-for-fraud-in-sri-lanka/articleshow/47164629.cms", "", "May 5, 2015", "Another Mahinda Rajapaksa loyalist held for fraud in Sri Lanka.\n\n PTILast Updated: May 05, 2015, 08:17 PM IST \n\n Synopsis\n\n. Rajapaksa are under the scanner for alleged financial fraud since their leader was defeated by current President Maithripala Sirisena.\n\n COLOMBO: A former senior minister and close aide of ex-Sri Lankan President Mahinda Rajapaksa has been arrested for fraud, police said today. \n\n The Colombo chief magistrate ordered that Johnston Fernando be remanded until tomorrow and be produced before a magistrate at Kurunegala, his northwestern provincial base. \n\n Fernando was arrested by police's Financial Crime Investigation Unit (FCIU) over alleged financial impropriety at the state wholesale entity Cooperative Wholesale Establishment (CWE) during Rajapaksa's rule. \n\n As minister of trade, Fernando was supervising CWE functions in the Rajapaksa cabinet. \n\n Several bigwigs and aides of Rajapaksa are under the scanner for alleged financial fraud since their leader was defeated by current President Maithripala Sirisena in the presidential election held in January. \n\n They include Rajapaksa's brother Basil who headed the powerful economic development ministry.The court today extended his remand custody until May 7. He had been remanded on April 25 on fraud charges. \n\n Rajapaksa's loyalists have urged the disbanding of FCIU claiming it is being used by Prime Minister Ranil Wickremesinghe for a political witch hunt against them."], ["", "https://thewire.in/south-asia/srilanka-rajapaksa-rule-of-law-suffers-onslaught-politics", "", "Nov 13, 2020", "Sri Lanka: Under Rajapaksas' Watch, Rule of Law Suffers the Onslaught of Politics\n\n The politically-motivated Presidential Commission of Enquiry has been distorting politically-connected criminal suspects into victims, and investigators and legal reformers into criminals.\n\n Sri Lanka, long-plagued by political violence and near-complete impunity for crimes by the state and pro-state forces, now faces a new assault on justice and the rule of law. There is a systematic attempt to rewrite the history to make politically-connected criminal suspects into victims, and investigators and legal reformers into criminals.\n\nThe unprecedented efforts of the government of Gotabaya Rajapaksa – most strikingly through his presidential commission of enquiry into so-called “political victimisation” – threatens to do more than just eliminate the possibility of justice in the specific cases it is considering. These specific cases relate to that of political allies of the state, and in instances where Rajapaksa family members are being rescued from prosecution. In doing so, it risks distorting judicial and police procedures, by which the very existence of a meaningful justice system is cast into doubt.\n\n International human rights watchdogs have understandably expressed concerns about the return of the Rajapaksa family to power, given the grave crimes committed during the years of Mahinda Rajapaksa’s presidency from 2005–15. A year into the presidency of his brother, Gotabaya, however, the signs suggest that the threat to dissenting voices and political opponents will, at least at first, be through more subtle means than the murders, assaults and enforced disappearances used to silence critics during their first regime. Legal attacks and legalised lies – not bodies in the street – seem likely to be the preferred means of destroying their opponents. The world needs to be alert to this and to find ways to respond.\n\n Entrenched Impunity\n\n From the first of its multiple post-independence insurrections in 1971 through to the end of its horrific 26-year war with the separatist Liberation Tigers of Tamil Eelam (LTTE), Sri Lanka suffered the gravest of crimes and political violence by state and non-state forces alike. Scores of political leaders were assassinated, hundreds of suicide bombings and massacres, tens of thousands of enforced disappearances and tens of thousands of civilians were killed in the final few months of fighting the Tamil Tigers.\n\n While some LTTE members were prosecuted for terrorist attacks over the years of their failed separatist struggle, just a handful of cases involving police and military and pro-government paramilitary forces have ever been successfully prosecuted.\n\nThere were promises – and some limited hopes – that this would change when a new government came to power in January 2015, following the surprise defeat of president Mahinda Rajapaksa by his former ally Maithripala Sirisena.  The government Sirisena formed with the backing of his prime minister Ranil Wickremesinghe – the leader of Sirisena’s long-time opponents, the United National Party (UNP) – pledged to its own citizens and to the United Nations that it would rebuild the independence of the police and judiciary and end institutionalised impunity.\n\n While no progress was made on the most controversial proposal – a criminal tribunal with international assistance to prosecute crimes committed in the final years of the civil war – a whole host of investigations into other high-profile political crimes, long-stalled in courts or buried in police files, began to move.\n\nReleased from its former political restrictions, the Criminal Investigation Department, along with other specialised units of the police, vigorously pursued scores of high-profile cases of murder, abduction, disappearances and large-scale fraud, crime committed by Mahinda Rajapaksa’s brother.\n\n Mahinda Rajapaksa is guilty. Strong resistance from the military, whose intelligence units were implicated in numerous of the so-called “emblematic cases”, skilful legal manoeuvres by the Rajapaksas, and various alleged behind-the-scenes political deals ultimately left the most important cases unfinished by the time Gotabaya Rajapaksa was elected as president in November 2019.\n\n Facing a major challenge from multiple high-profile cases implicating the family, their allies and police and military units under their commands, the new administration chose the bold path of directly challenging the reality of powerful and widely publicised evidence.  The government launched a campaign to discredit the evidence first by carefully cultivating public opinion through accusations of nationalist Buddhist monks and family-backed media outlets, who accused key investigators of being foreign collaborators, in the pay of NGOs.\n\nThen on 22 January 2020, President Gotabaya Rajapaksa appointed a quasi-judicial body, Commission of Inquiry, to probe alleged political victimisation of members of the armed forces, police and public service between 2015 and 2019. The Commission has been chaired by a retired judge of the Supreme Court, whose previous conduct was examined by the apex court itself, and found worthy of disciplinary action. The other two members are another retired judge and a retired inspector general of police who served as an advisor to former President Mahinda Rajapaksa, who is now Prime Minister under his brother, President Gotabaya Rajapaksa.\n\n"], ["", "https://m.economictimes.com/news/international/world-news/former-lankan-president-mahinda-rajapaksa-fears-prosecution-of-entire-family-by-new-government/articleshow/47039369.cms", "", "Apr 24, 2015", "Former Lankan president Mahinda Rajapaksa fears prosecution of entire family by new government\n\n PTILast Updated: Apr 24, 2015, 04:39 PM IST\n\n Synopsis\n\n Former Lankan President Mahinda Rajapaksa expressed fears that the new government led by Maithripala Sirisena might end up prosecuting his entire family.\n\n COLOMBO: Former Sri Lankan President Mahinda Rajapaksa today expressed fears that the new government led by his successor Maithripala Sirisena might end up prosecuting his entire family, a day after his two younger brothers faced questioning by anti-graft investigators. \n\n Next, it will be Gotabhaya Rajapaksa, Mahinda Rajapaksa, Namal Rajapaksa and Yoshitha Rajapaksa, the former President said. \n\n Namal - a parliamentarian - and Yoshitha are Rajapaksa's sons while Gotabhaya is his younger brother. \n\n Rajapaksa's comments came after he visited his youngest brother Basil Rajapaksa at the national hospital where he is warded under remand custody. \n\n Basil, the economic development minister in his older brother's neary decade-long rule, was arrested on Wednesday by the police's Financial Crime Investigation Unit. \n\n He was accused of misappropriating 77 million rupees of state funds meant for livelihood development. \n\n Rajapaksa said his family was being hounded by the Sirisena government on trumped-up charges. \n\n Gotabhaya, who served as the powerful defence ministry secretary, appeared yesterday for the second time before the anti-graft commission as Basil faced his own interrogation behind bars. \n\n The new government has pursued complaints of misdeeds under Rajapaksa's regime and several top ranking officials have already faced prosecution. \n\n"], ["", "https://countercurrents.org/2019/02/citizens-deman-no-invite-to-mahinda-rajapaksa-war-criminal-go-back/", "", "Feb 8, 2019", "Citizens Demand, No Invite To  Mahinda Rajapaksa, War Criminal Go Back!\n\n We the undersigned strongly condemn the invitation to Mahinda Rajapaksa, war criminal and former President of Sri Lanka, to deliver the inaugural address at the The Huddle, an annual conclave organized by The Hindu, News Paper, in Bangalore.\n\n The conclave, according to The Hindu, is a thoughts and ideas conclave, a platform that attempts to bring under a single roof some of the best minds from politics, academia, the entertainment industry, the corporate world, sports and civil society.\n\n Inviting Mahinda Rajapaksa to the event,is an insult to the memory of over 1,40,000 innocent Tamil civilians killed by Sri Lankan armed forces in the last few months of the civil war in 2009. Rajapaksa, was one of the main architects of the Eelam Tamil genocide, condemned by human rights groups around the world.\n\n Nearly three Lakh Eelam Tamils(Tamils from the north and east of Sri Lanka) who were displaced by war were herded into concentration camps and underwent torture and abuse at the hands of the military. Many of those who surrendered have not been seen again. Thousands of victims of Rajapaksa’s war are still living in Tamil Nadu as refugees.\n\nThe Sri Lankan government headed by Mahinda Rajapaksa maintained that the war did not have any civilian casualties. But various independent accounts and UN reports have confirmed that the Sri Lankan military targeted civilian structures and ‘No Fire Zones’, with the only aim of maximizing the killings of Tamil civilians. The 2010, Permanent Peoples Tribunal session in Dublin was the first to charge the Sri Lankan government with war crimes, with the set of limited evidences that was available at that time.\n\n The 2011 Report of the Secretary-General’s Panel of Experts on Accountability in Sri Lanka concluded that the conduct of the war represented a grave assault on the entire regime of international law designed to protect individual dignity during both war and peace and also called for an independent international investigation by the UN Secretary General into the alleged violations of international humanitarian and human rights law. The The United Nations secretary-general’s internal review on UN action in Sri Lanka  report submitted by Charles Petrie stated From as early as 6 February 2009, the Sri Lankan Army continuously shelled within areas that became the second No Fire Zone, from all directions, including land, sea and air. It is estimated that there were between 300,000 and 330,000 civilians in that small area. In 2013, the Permanent Peoples Tribunal session in Bermen,concluded that On the strength of the evidence presented, the tribunal reached the consensus ruling that the state of Sri Lanka is guilty of the crime of genocide against Eelam Tamils.\n\n. Mahinda Rajapaksa also unleashed unprecedented media suppression in Sri Lanka. Under Rajapaksa dozens of news websites were blocked, media institutions attacked, dozens of journalists were abducted and killed with total impunity. Mahinda Rajapaksa and his brother, defense secretary, Gotabaya Rajapakse gave death threats openly to the dissenting journalists. Lasantha Wickrematunge, who posthumously received the World Press Freedom Prize awarded by UNESCO, was killed in broad day light for being critical of corruption of the Rajapaksa government, human rights violations and the war. In 2014 the Rajapaksa’s government went to the extent of issuing a circular in which it banned non-governmental organizations from holding press conferences, workshops, training courses for journalists.\n\n Despite all these opinions from UN bodies and international human rights bodies, The Hindu has always shown open support to Mahinda Rajapaksain its editorials and columns. Mahinda Rajapaksa has blood on his hands, the blood of innocent Tamils, honest and brave journalists and uncompromising rights activists. To call him to deliver an inaugural address at The Huddle is an injustice to not just journalism but humanity itself and we strongly demand that The Hindu drop Rajapaksa from the list of invitees.\n\nSwami Agnivesh, Social Activist\n\nBinoy Viswam M.P, Former Forest Minister in the Government of Kerala\n\n"], ["", "https://www.thehindu.com/news/international/south-asia/rajapaksa-promises-to-reform-presidency-if-reelected/article6719397.ece", "", "Aug 28, 2017", "Ahead of polls, Rajapaksa promises inquiry into war crime allegations \n\n Justice will be ensured through domestic judicial mechanism\n\nDecember 23, 2014 04:36 pm | Updated May 23, 2016 06:33 pm IST - Colombo\n\nMEERA SRINIVASAN\n\n Sri Lankan President Mahinda Rajapaksa greats Buddhist monks during the launch of his election manifesto in Colombo, Sri Lanka, Tuesday, Dec. 23, 2014. Rajapaksa will face his former health minister Maithripala Sirisena in the Jan. 8 presidential elections. (AP Photo/Eranga Jayawardena)\n\n President Mahinda Rajapaksa, who faces elections in a fortnight, on Tuesday promised to initiate a transparent, judicial inquiry probing allegations of war crimes against the Sri Lankan army.\n\nHe made the announcement while releasing his election manifesto ahead of the January 8 presidential election, which promises to be one of the closest contests in the island’s recent history.\n\n"]]