[["", "https://economictimes.indiatimes.com/news/defence/at-least-six-pakistani-banks-named-in-global-money-laundering-list/articleshow/78252908.cms?from=mdr", "", "Sep 24, 2020", "At least six Pakistani banks named in global money laundering probe\n\n Synopsis\n\nThe International Consortium of Investigative Journalists (ICIJ) and Buzzfeed News carried out an investigation and found that at least 29 suspicious transactions worth about $2.5 million related to Pakistani banks, that may have been used for money laundering.\n\nISLAMABAD: At least six Pakistani banks have been named in an investigation on the role global banks play in money laundering, which make up to at least $2.5 million.\n\nThe International Consortium of Investigative Journalists (ICIJ) and Buzzfeed News carried out an investigation and found that at least 29 suspicious transactions worth about $2.5 million related to Pakistani banks, that may have been used for money laundering.\n\nAs per the investigation, all of 29 suspicious transactions were done during the year 2011 and 2012. \n\nThe investigation details by Buzzfeed News, shared with the ICIJ revealed that global banks to the US Treasury Department's Intelligence Unit, the Financial Crimes Enforcement Network known as FinCEN, filed over 2,100 suspicious activity reports. \n\nThe report revealed that global banks moved more than $2 trillion between 1999 and 2017 in suspicious payments, flagging clients in more than 170 countries, identified as being involved in illicit transaction. \n\nAs per revealed data on Pakistani banks, out of the 29 suspicious transactions to and from Pakistan, received transactions amounted to $1,942,560 while the sent transactions were $452,000, which include at least 12 suspicious transactions by Allied Bank, eight flagged transactions by United Bank Limited, three by Bank Alfalah, four transactions by Standard Chartered Bank and one by Habib Bank Limited. \n\nThe report has put another dent on global image of Pakistan's crippling economy and its position on money laundering. \n\nIt comes at a time when Pakistan is working hard towards fulfilling the 27-point-action plan of the global watchdog on terror financing and money laundering, the Financial Action Task Force (FATF). \n\nPakistan currently is in the grey list of the FATF and is working on compliance of the action plan to ensure that it saves itself from being pushed ahead into the black list, which would attract global financial sanctions. \n\n"], ["", "https://www.daijiworld.com/news/newsDisplay?newsID=1007106", "", "Oct 6, 2022", "Pakistani banks routinely indicted for money laundering and terror financing\n\n Thu, Oct 06 2022 01:16:33 PM\n\n By Rahul Kumar\n\n New Delhi, Oct 6: Recently Habib Bank Limited (HBL), Pakistan's largest private sector bank with international branches, faced allegations of helping global terror organisation Al-Qaeda, leading to deaths and injuries to hundreds of people in Afghanistan.\n\n Pakistani newspaper Dawn reported that a US court said terror financing by Habib Bank led to attacks that killed and injured 370 people in Afghanistan during 2021 and 2019. Also, nearly 370 individual complainants are demanding compensation from the bank. The bank is contesting these charges in the US court refuting the allegations as 'meritless'.\n\n This is, however, not the first time that Pakistani banks, or even the Habib Bank, are facing allegations and investigations of a serious nature.\n\nIndia Narrative spoke with geopolitical analyst Mark Kinra who says: It is not the first time that HBL has been accused of terror-related activities in the US. In 2007, Habib Bank was sued by the widow of journalist Daniel Pearl for financially helping Al-Qaeda and other terrorist groups. In 2017, it had to shut down its only US branch and was penalised $225 million for illicit money transfers.\n\n Kinra says that not just Habib Bank, but several other Pakistani banks have faced scrutiny over the years.\n\n Earlier this year the National Bank of Pakistan paid $55 million in fines for non-compliance and money laundering in New York. News agency Reuters reported: The Federal Reserve Board and Federal Reserve Bank of New York, and the New York State Department of Financial Services (NYDFS) announced on Thursday that the NBP's New York branch would be fined up to $55.4 million for non-compliance and anti-money laundering violations.\n\n Kinra says: In 2020, six Pakistani banks were found to be involved in 29 suspicious transactions amounting to $2.5 million between 2011 and 2012. These banks included Allied Bank, United Bank (UBL), Habib Metropolitan Bank, Bank Alfalah, Standard Chartered Bank Pakistan, and Habib Bank (HBL).\n\n The indictment of Habib Bank is important because of the New York district court's remarks. The complaints allege that the defendant took deliberate steps to help customers evade international sanctions regimes, and in doing so incurred business risk that ultimately led to the defendant's expulsion from the US. Those allegations are sufficient …, the court said. \n\n As Pakistan's largest bank, HBL is also active in the Shanghai Cooperation Organisation Interbank Consortium (SCO-IBC) for over a decade. At the recently held SCO Heads of State meet in Samarkand, Uzbekistan, HBL was present as Pakistan's only bank with focus on regional trade and investment.\n\n HBL became the first Pakistani bank to open a branch in China, also becoming one of the few foreign banks to operate from the communist country. It has been spearheading the $62 billion China Pakistan Economic Corridor (CPEC) project by providing banking and financial services.\n\n Since the establishment of CPEC in 2013, HBL has formed a dedicated China coverage team comprised of Chinese and Pakistani bankers in Karachi, Lahore, and Islamabad to provide financial services exclusively to Chinese firms. The bank opened a branch in the Gwadar Free Zone in 2016 for Chinese investors and people who were developing factories there, says website Global Village Space.\n\n The bank's woes came to limelight just a month after a team of the France-based watchdog, Financial Action Task Force (FATF), travelled to Pakistan on a three-day visit to check if Pakistan had made progress in closing down financing of terror activities and curbing international terror groups.\n\n"], ["", "https://economictimes.indiatimes.com/topic/alfalah-bank", "", "Sep 24, 2020", "At least six Pakistani banks named in global money laundering probe\n\n Synopsis\n\nThe International Consortium of Investigative Journalists (ICIJ) and Buzzfeed News carried out an investigation and found that at least 29 suspicious transactions worth about $2.5 million related to Pakistani banks, that may have been used for money laundering.\n\nISLAMABAD: At least six Pakistani banks have been named in an investigation on the role global banks play in money laundering, which make up to at least $2.5 million.\n\nThe International Consortium of Investigative Journalists (ICIJ) and Buzzfeed News carried out an investigation and found that at least 29 suspicious transactions worth about $2.5 million related to Pakistani banks, that may have been used for money laundering.\n\nAs per the investigation, all of 29 suspicious transactions were done during the year 2011 and 2012. \n\nThe investigation details by Buzzfeed News, shared with the ICIJ revealed that global banks to the US Treasury Department's Intelligence Unit, the Financial Crimes Enforcement Network known as FinCEN, filed over 2,100 suspicious activity reports. \n\nThe report revealed that global banks moved more than $2 trillion between 1999 and 2017 in suspicious payments, flagging clients in more than 170 countries, identified as being involved in illicit transaction. \n\nAs per revealed data on Pakistani banks, out of the 29 suspicious transactions to and from Pakistan, received transactions amounted to $1,942,560 while the sent transactions were $452,000, which include at least 12 suspicious transactions by Allied Bank, eight flagged transactions by United Bank Limited, three by Bank Alfalah, four transactions by Standard Chartered Bank and one by Habib Bank Limited. \n\nThe report has put another dent on global image of Pakistan's crippling economy and its position on money laundering. \n\nIt comes at a time when Pakistan is working hard towards fulfilling the 27-point-action plan of the global watchdog on terror financing and money laundering, the Financial Action Task Force (FATF). \n\nPakistan currently is in the grey list of the FATF and is working on compliance of the action plan to ensure that it saves itself from being pushed ahead into the black list, which would attract global financial sanctions. \n\n"], ["", "https://www.weforum.org/agenda/authors/ikram-ul-majeed-sehgal", "", "May 19, 2022", "Ikram Sehgal \n\nChairman, Pathfinder Group \n\n and \n\n Chairman, Karachi Council on Foreign Relations (KCFR)\n\n PATHFINDER GROUP has about 12000 employees in over 50 cities/towns in Pakistan. Pathfinder Group includes in its Security Services Division: Security & Management Services (Pvt) Ltd (SMS), Wackenhut Pakistan (Pvt) Ltd (WPPL), the other companies in its Security Services Division are SMS Electronic Safety Services (Pvt) Ltd (SMS ESS), Research & Collection Services (Pvt) Ltd (RCS), and Facility Specialist & Multi Services (Pvt) Ltd (FSMS).The Financial Services and Technology Division includes: Virtual Remittance Gateway (Pvt) Ltd (VRG), i3 Pathfinder (Pvt) Ltd and iPath (Pvt) Ltd. \n\n Graduate, Pakistan Military Academy, Kakul; served in Pakistan Army (Infantry and Army Aviation). First Pakistani PW in history to escape from India (in July 1971). Battlefield promotion to rank of Major commanding a rifle company on 13 Dec 71. Commercial Pilots Licence (CPL) with over 2000 hours in helicopters and fixed-wing aircraft.\n\n Director EastWest Institute (EWI) USA (Director of the Year 2016), Sehgal is the Publisher & Chief Editor of Defence Journal (DJ), writing weekly columns for various magazines and newspapers. Former Director Bank Alfalah Ltd (16 years) and Chairman K-Electric (KE) and Foundation Member, World Economic Forum (WEF), Switzerland, Formerly Member WEF Global Agenda Council (GAC) for Counter-Terrorism and now Anti-Corruption and Transparency” and Member WEF Partnering Against Corruption Initiative (PACI). Former Member Business Advisory Board (BAB), International Organization for Migration (IOM), Geneva, Sehgal is Co-Chairman of the ‘Pakistan Committee’ of the Swiss-Asian Chamber of Commerce (SACC), Geneva. Former Chairman All Pakistan Security Agencies Association (APSAA). Senior Adviser, Director and Member Advisory Committee on CPEC Projects of the National Institute of Strategic Communication (NISC), Peking University, China. Regular Speaker at Defence Services Institutions (like National Defence University (NDU), etc) and International Think Tanks, Sehgal is Vice President and Member Executive Committee, Council of Pakistan Newspaper Editors (CPNE). He is Chairman, Karachi Council on Foreign Relations (KCFR), Karachi and Member Board of Governors (BOG), Lawrence College, Ghora Gali (GG)."], ["", "https://www.wsj.com/market-data/quotes/PK/XKAR/BAFL/company-people", "", "Dec 31, 2022", "Company Info Bank Alfalah Ltd\n\nDescription Bank Alfalah Ltd\n\nBank Alfalah Ltd. operates as a holding company. The firm engages in the provision of commercial banking and related services. It operates through the following segments: Retail Banking, Corporate Banking, Treasury, Digital Banking, Islamic Banking, International Operations, Brokerage, and Others. The Retail banking segment includes loans, deposits, trading activity, wealth management and other banking transactions. The Corporate Banking segment comprises loans, deposits, project financing, trade financing, investment banking and other banking activities with bank's corporate and public sector customers. The Treasury segment consists of liquidity management activities carried out through borrowing, lending, money market, capital market and merchant banking operations. The Digital Banking segment composes branchless banking accounts, deposits and lending products, digital channels, corporate, G2P and SMME portfolio, digital payments and digital products. The Islamic Banking segment pertains to full scale Islamic Banking operations of the bank. The International Operations segment encompasses amounts related to bank's overseas operations, namely, commercial banking activities in Bangladesh, Afghanistan, United Arab Emirates and wholesale banking activities in the Kingdom of Bahrain. The Brokerage segment handles asset management activities mainly through the subsidiary Alfalah CLSA Securities Limited. The Others segment covers the head office related activities. The company was founded on June 21, 1992 and is headquartered in Karachi, Pakistan. \n\nKey People Bank Alfalah Ltd\n\nAverage Growth Rates Bank Alfalah Ltd\n\nInsider Trading Bank Alfalah Ltd.\n\nOwnership Bank Alfalah Ltd"]]