[["", "https://www.hughjames.com/blog/hj-talks-about-abuse-abuse-by-overseas-teacher-james-alexander/#:~:text=He%20was%20convicted%20of%20plotting,to%20five%20years%20in%20jail", "", "May 21, 2021", "HJ Talks About Abuse: Abuse by Overseas Teacher James Alexander. Over the last few months, we have discussed abuse in education by teachers. Within such profession, we expect a high standard from those looking after children to have sufficient background checks and be of suitable character. We now turn to discuss abuse overseas following the conviction of British Music National teacher, James Alexander. Alexander was a former British employed teacher who had worked at Bromsgrove International School in Bangkok. During his time overseas, he tried to orchestrate the abuse of young girls in the Philippines.  Alexander had been subject to an investigation where it was found he had sent 15 money transactions to unidentified facilitators known for live-streaming child abuse from Iligan City in Northern Mindanao, Philippines. Evidence was accumulated against Alexander that he was carrying out offences between 2017-2020. His devices were seized on arrival in the UK which showed he had asked the facilitators to send him images of girls under 13 posing indecently. Investigators also said they found numerous illicit photos of minors on Alexander’s phone along with messages in which he described how would like to abuse children as young as 4. The investigation noted, Alexander tried to arrange travel to the Philippines to abuse children in person, but there are no records of him ever traveling there. The UK National Crime Agency’s senior investigating officer, Hazel Stewart stated “Alexander clearly tried to manipulate and exploit the poverty of the vulnerable in order to gratify his sick sexual desires. He believed he could abuse Filipino children safely from his home and wanted to visit the Philippines to carry out the sexual abuse himself.” Several children placed under protective care. He was convicted of plotting to abuse children in the Philippines by the Leeds Crown Court, and was banned from all foreign travel and placed on a permanent sex offender list after trying to arrange to abuse children in the Philippines. Alexander was sentenced to five years in jail. Sexual abuse against children conducted in different countries continues to be on the increase with ever evolving technology. This is not the first time we see such shocking headlines. BBC investigations presented by Stacey Dooley documented “Mums Selling Their Kids for Sex” in the Philippines where Filipino mothers sexually abuse their own children, live in front of webcams in exchange for money. ICE Homeland Security Investigations (HSI), conducted a secret operation in the hope of arresting several mothers who were selling their own children for sex. The investigation found the disturbing reality was many of the abusers were coming from the US and the UK. Abusers can still face criminal sanctions in the UK even if the offences are committed abroad. Hugh James acted for the claimants in the successful High Court action brought against Derek Slade who had sexually abused boys in the Philippines. Slade was found by the judge to have sexually abused five boys and ordered him to pay them compensation."], ["", "https://www.nationalcrimeagency.gov.uk/news/five-years-in-jail-and-worldwide-travel-ban-for-british-teacher-who-wanted-to-abuse-young-filipino-children", "", "Jan 9, 2021", "Five years in jail and worldwide travel ban for British teacher who wanted to abuse young Filipino children. A music teacher has been jailed for five years.A music teacher has been jailed for five years for plotting to sexually abuse young girls in the Philippines. James Alexander, 42, was caught by the National Crime Agency after he sent money to known facilitators who had live-streamed child sexual abuse from Illigan City. He was arrested on 30 June 2018 at Manchester Airport as he flew into the UK from Thailand where he lived since 2017. NCA investigators seized his electronic devices. Forensic analysis showed Alexander, of Beeston, Leeds, sent at least 15 money transfers to abuse facilitators between August 2017 and Jun 2018. It also showed that Alexander - who served as a reservist in the Parachute Regiment from 1999 to 2003 – tried to arrange with abuse facilitators over Skype and WhatsApp to travel to the Philippines to abuse little girls himself. Alexander had a discussion with one female facilitator about a 13 year-old girl, in which he said: If I meet anyone else I would like younger. He then asked the facilitator for pictures of her 12-year-old daughter. It is believed indecent images of the 12-year-old were sent to him, as his recovered chat history shows he said: nice baby…now take the other pictures I asked.” On 1 February 2018 he and the woman discussed plans for him to meet the girls in a hotel and he asked: Are you going to bring them both with you and stay also”. He added: You’ll show them what to do.” The woman told Alexander she had other daughters aged nine, six and four. Alexander, who taught in Leeds and Malaysia before moving to Thailand, asked for sick images of the girls aged nine and six posing in a certain way, and asked what the six-year-old would do with him. He also explained how he would like to sexually abuse the four-year-old. Alexander told another Filipino mother – who says she will make her daughters do anything for money – that he wants to have sex with her seven and 11-year-old girls. He directed them to pose for photographs. NCA officers also discovered other WhatsApp messages where Alexander asked a 10-year-old to send him images of her posing, and asked if he could meet her. There were no records of Alexander ever travelling to the Philippines. In-country investigations into the facilitators continue but as a result of NCA intelligence, one suspect was arrested and several children safeguarded. Alexander taught at Bromsgrove International School in Bangkok, Thailand, which dismissed him upon notification of the investigation. Safeguarding checks were made at the school and there was no evidence of Alexander offending there. Alexander’s phone contained child abuse images. He admitted one count of arranging/facilitating the commission of a child sex offence; three counts of attempting to cause/incite a girl under 13 to engage in sexual activity, and one count of making an indecent image of a child. Alexander, who also performed as a DJ in Thailand, was prosecuted under section 72 of the Sex Offences Act 2003 which allows British nationals to be prosecuted in the UK for offences committed abroad. Today, at Leeds Crown Court, he was also given a five-year sexual harm prevention order which bans foreign travel, and he was made to sign the sex offenders register for life. Hazel Stewart, NCA senior investigating officer, said: Alexander clearly tried to manipulate and exploit the poverty of the vulnerable in order to gratify his sick sexual desires. He believed he could abuse Filipino children safely from his home and wanted to visit the Philippines to carry out the sexual abuse himself. The NCA has strong partnerships with law enforcement in the Philippines. We work together to combat this kind of offending. We and UK policing will never give up our pursuit of offenders who commit these horrendous crimes. Victims or anyone with information about child sexual abuse offences should contact their local police. Child Protection Charity The Lucy Faithfull Foundation runs the Stop It Now! helpline which offers confidential advice to anyone concerned about their own or someone else’s behaviour towards children."], ["", "https://caselaw.findlaw.com/court/ut-supreme-court/1600364.html", "", "May 4, 2012", "STATE v. ALEXANDER (2012) \n\nSupreme Court of Utah. \n\n STATE of Utah, Plaintiff and Petitioner, v. James Norman ALEXANDER, Defendant and Respondent. \n\nNo. 20090829. Decided: May 04, 2012 \n\nMark L. Shurtleff, Att'y Gen., Marian Decker, Asst. Att'y Gen., Salt Lake City, for petitioner. Linda M. Jones, Michael R. Sikora, Salt Lake City, for respondent.\n\nINTRODUCTION \n\n 1 In this case, we consider the showing required for a defendant to withdraw a guilty plea under the current version of section 77–13–6 of the Utah Code (Plea Withdrawal Statute or Statute)2 and rule 11 of the Utah Rules of Criminal Procedure.2 In 2007, James Alexander pled guilty to burglary with intent to commit sexual battery. Prior to his sentencing, Mr. Alexander filed a timely motion to withdraw his guilty plea. In that motion, he argued that when the district court accepted his guilty plea, it failed to apprise him of the elements of sexual battery, as required by rule 11. In addition, he alleged that he was never otherwise informed of the elements of sexual battery, and his plea was therefore not knowingly and voluntarily made. The district court denied Mr. Alexander's motion and sentenced him to a prison term of one to fifteen years.\n\n 3 On appeal, the Utah Court of Appeals reversed the district court's decision, concluding that the district court did not comply with rule 11(e)(4)(A) at the plea hearing because it did not inform Mr. Alexander of the elements of sexual battery, which was the specific intent crime underlying the burglary charge. The court of appeals assumed that the violation of rule 11 automatically rendered the plea unknowing and involuntary. Thus, it held that Mr. Alexander was entitled to withdraw his guilty plea.\n\n 4 We granted certiorari to resolve three issues: (1) whether the court of appeals erred in its evaluation of the case in relation to the record and the standard for a knowing and voluntary plea,” (2) whether the court of appeals erred in declining to require a showing of prejudice before holding that a defendant may withdraw a guilty plea,3 and (3) whether the court of appeals' decision in this case conflicts with our prior holding in Hurst v. Cook.4\n\n5 A majority of the court agrees on the following. First, three members of this court hold that, although the court of appeals erred in limiting its review to whether the district court had complied with rule 11 during the plea hearing, the record nonetheless demonstrates that Mr. Alexander's plea was not knowingly and voluntarily made. Second, three members of this court hold that the court of appeals did not err in declining to require a showing of prejudice because such a showing is not required by rule 11(l ). Finally, the court unanimously holds that, because this case involves a different issue than the one addressed in our holding in Hurst, the two cases do not conflict. Based on these conclusions, we affirm the court of appeals' decision to allow Mr. Alexander to withdraw his guilty plea.\n\n BACKGROUND\n\n 6 In 2007, Mr. Alexander was charged with rape, a first degree felony, and forcible sexual abuse, a second degree felony. At the preliminary hearing on these charges, the alleged victim testified that on January 29, 2006, Mr. Alexander phoned her and said he wanted to come to her house and have sex with her. She stated that she had told Mr. Alexander he could come to her home, but she would not have sex with him. When Mr. Alexander arrived, he began talking about sexual acts and she again stated that she did not want to have sex with him. Mr. Alexander nonetheless began to hug and kiss her. He grabbed her arms and breasts and touched her vagina. She testified that she pulled away from Mr. Alexander and told him to back off and get the hell off [her]. She stated that Mr. Alexander then pushed her down on the bed, climbed on top of her and forced her to have sexual intercourse without her consent. Although he did not testify at the preliminary hearing, Mr. Alexander denied the allegations and pled not guilty to the charges.\n\n 7 Sometime after the preliminary hearing, Mr. Alexander and the State entered into plea negotiations. Mr. Alexander subsequently agreed to plead guilty to an amended charge of burglary5 with the intent to commit sexual battery,6 a second degree felony. The amended charging documents described the burglary charge as follows:\n\n [O]n or about January 29, 2006, in violation of Title 76 Chapter 6, Section 202, Utah Code Annotated 1953, as amended, ․ the defendant, James N. Alexander, a party to the offense, entered or remained unlawfully in the dwelling of [the alleged victim] with the intent to commit a sexual battery.\n\n 8 At the same time that the State filed the amended charging documents, Mr. Alexander and his counsel signed a Statement of Defendant in Support of Guilty Plea (Plea Affidavit). In the Plea Affidavit, the elements of the burglary charge were identified as follows: The defendant (1) remained unlawfully (2) in a dwelling (3) with the intent to commit a felony, theft, assault, lewdness, or sexual battery. Neither the amended charging documents nor the Plea Affidavit described or listed the elements of sexual battery. As to the factual basis for the burglary charge, the Plea Affidavit stated, On 1/29/06 at [omitted address] in Salt Lake County, Utah, the defendant was in the apartment of [the alleged victim] and committed the offense of sexual battery on [her].\n\n 9 Before accepting the guilty plea, the district court held a hearing where it reviewed with Mr. Alexander the amended charging documents and the Plea Affidavit. Although the district court did not discuss the elements of sexual battery, the court did ask Mr. Alexander's counsel if he had explained what a second degree felony means and if he felt that Mr. Alexander was entering a knowing and voluntary plea. Mr. Alexander's counsel stated that he had reviewed the amended [charging documents] with [Mr. Alexander] as well as th [e] [Plea Affidavit] outlining all of those issues.He also articulated the factual basis for the plea as follows:\n\n [O]n January 29th [of] 2006 ․, Mr. Alexander was in the [home] of [the alleged victim], a friend of his․ [H]e was allowed into the [home], but while [there], he committed the offense of sexual battery on [her].\n\n The prosecutor then clarified that while Mr. Alexander was in the alleged victim's home, she start[ed] to do some actions that clearly t[old][him] that he need[ed] to be out of the apartment and instead of leaving, he remain[ed] with the intent as we've outlined. When the court asked Mr. Alexander if that factual basis was accurate, he responded, Yes, sir. The court then informed Mr. Alexander of the rights he was waiving by pleading guilty, and the court accepted his guilty plea.\n\n 10 Prior to sentencing, Mr. Alexander filed a timely motion to withdraw his guilty plea. In support of his motion, he alleged that the district court had failed to apprise him of the nature and elements of sexual battery, as it was required to do by rule 11(e)(4)(A) of the Utah Rules of Criminal Procedure.7 He also asserted that, because he was never informed of the nature and elements of sexual battery, which was the specific intent crime underlying the burglary charge, his plea was not knowingly and voluntarily made. The court denied Mr. Alexander's motion and later sentenced him to a prison term of one to fifteen years.8\n\n 11 Mr. Alexander appealed the district court's denial of his motion to the Utah Court of Appeals. At the court of appeals, he argued that his plea was unknowing and involuntary because he did not understand the nature and elements of sexual battery.9 The court of appeals reviewed the Plea Affidavit and the plea hearing, and it determined that they contain[ed] no discussion of the elements of sexual battery.10 The court stated that because intent to commit sexual battery was the crux of the burglary charge against [Mr. Alexander], the trial court was required [by rule 11(e)(4)(A) ] to ensure that [he] understood the elements of sexual battery-and that he was pleading guilty to all of those elements-before accepting his guilty plea.11 The court of appeals assumed that because the district court had failed to comply with rule 11 when accepting Mr. Alexander's guilty plea, the plea was not knowingly and voluntarily entered.12 Accordingly, the court of appeals reversed the district court's decision and held that Mr. Alexander could withdraw his guilty plea.13\n\n 12 After the court of appeals issued its opinion, the State filed a petition for certiorari, which we granted. The State contends that the court of appeals erred in three respects. First, the State argues that the court of appeals erred in limiting its analysis to whether the district court complied with rule 11 and in assuming that a violation of rule 11 automatically renders a plea unknowing and involuntary. The State asserts that, under a proper analysis, the court would conclude that Mr. Alexander's plea was in fact knowing and voluntary because the record demonstrates that he was adequately informed of the intent to commit sexual battery element of the burglary charge. Second, the State contends that the court of appeals erred in declining to require Mr. Alexander to demonstrate that, but for any deficiency in the plea, he would not have pled guilty. According to the State, such a showing is mandated by rule 11(l ). Finally, the State argues that the court of appeals' decision conflicts with our prior holding in Hurst v. Cook,14 and that this conflict requires reversal.\n\n 13 In contrast, Mr. Alexander first argues that even if the court of appeals did err in its analysis, the record does not demonstrate that he was adequately informed of the elements of sexual battery, and thus, his plea was not knowing and voluntary. Second, he contends that the court of appeals did not err in declining to require a showing of prejudice because rule 11(l ) does not mandate such a showing. Finally, he argues that the court of appeals' decision in the instant case does not conflict with our prior holding in Hurst because the two cases address separate and distinct issues.\n\n 14 We have jurisdiction pursuant to section 78A–3–102(3)(a) of the Utah Code."], ["", "https://sports.yahoo.com/briton-sentenced-five-5-years-075851238.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAA9ZzIgL4ZuJHqU5Xeiu2qDIu9PmTbzvCnwVOywFBp5HaozjN9vkmys-VUlgj5fVDmWLNrkdCD6b3PybHM6SBCdz3654Evlf9vyCPuZWDfs2ziUE4PjC4P2QDS3SDa_dHdD0iywzhGAjsYsQMgnbfIw-uEcWPjBUnNES8urimhsv", "", "May 7, 2019", "Briton sentenced to five 5 years in jail for plotting sexual abuse of young Filipinos. A 42-year-old British man has been sentenced to five years in jail for trying to orchestrate the abuse of young girls in the Philippines. James Alexander, a former teacher at Bromsgrove International School in Thailand, was caught by United Kingdom’s National Crime Agency (NCA) after he sent money to people who had live-streamed child sexual abuse from Iligan City, Lanao del Norte. He was jailed late last week. He was convicted of plotting to abuse children by the Leeds Crown Court, which also banned him from all foreign travel and placed him on a permanent sex offender list. Alexander clearly tried to manipulate and exploit the poverty of the vulnerable in order to gratify his sick sexual desires, said NCA Senior Investigating Officer Hazel Stewart. He believed he could abuse Filipino children safely from his home and wanted to visit the Philippines to carry out the sexual abuse himself. The Leeds native was arrested by the agency last year on June 30 upon arriving at the Manchester Airport from Thailand, where he had lived since 2017. The NCA said one suspect in the Philippines has been arrested and several children have been placed under protective care. After arresting Alexander, investigators found evidence on his devices of at least 15 money transfers to abuse facilitators between August 2017 and this past June. During that time, he asked the facilitators to send him images of girls under 13 years old posing indecently. Investigators also said they found numerous illicit photos of minors on Alexander’s phone along with messages in which he described how he would like to abuse children as young as 4 years old. What’s more, Alexander tried to arrange travel to the Philippines to abuse children in person, but there are no records of him ever traveling there. While living in Thailand, Alexander worked as a part-time DJ while teaching at Bromsgrove International, which is located in the eastern district of Min Buri, Bangkok. He was dismissed from the school shortly after he was arrested. The agency said no evidence of abuse was found during his time at the school. Reached for comment this afternoon, the school declined to respond."]]