[["", "https://www.business-standard.com/about/who-is-mehul-choksi", "", "Oct 11, 2023", "Who is Mehul Choksi?\n\n Mehul Choksi is a fugitive Indian businessman and the owner of Gitanjali Group, a retail jewellery firm with 4,000 stores in India. Choksi is currently residing in Antigua and Barbuda where he holds citizenship. Choksi, along with his nephew Nirav Modi, is wanted by Indian authorities in the Punjab National Bank (PNB) scam where it is alleged that the Choksi-Modi duo defrauded the bank of more than Rs 14,000 crore. An arrest warrant has been issued against Choksi and he is wanted in India for criminal conspiracy, criminal breach of trust, cheating and dishonesty including delivery of property, corruption, and money laundering.\n\n Early life\n\n Choksi was born in Mumbai on May 5, 1959. He went to G D Modi College in Palanpur, Gujarat. He has a son and two daughters. One of his daughters is married to Akash Mehta, an Antwerp-based diamond merchant. He is the maternal uncle of Nirav Modi. Choksi’s younger brother Chetan Chinubhai Choksi owned a diamond company named Diminco NV, which is based in Antwerp. The company defaulted on a $25.8 million to a subsidiary of ICICI Bank.\n\n Choksi started his career in the gem and jewellery business in 1975 and took over the leadership of Gitanjali Gems from his father Chinubhai Choksi in 1985. At that time, the firm was focused on rough and polished diamonds.\n\nPNB scam\n\n A special PMLA court in March 2018 issued non-bailable arrest warrants against Choksi and his nephews Nirav Modi and Neeshal Modi. They allegedly colluded with the PNB Bank officials to defraud the bank of over Rs 14,000 crore. The scam is said to be the biggest in India’s banking history. PNB Bank officials at the Brady House branch in Fort, Mumbai issued fake Letters of Undertaking (LoUs). The LoUs were opened in favour of branches of Indian banks for the import of pearls for a period of one year, for which Reserve Bank of India (RBI) guidelines lay out a total time period of 90 days from the date of shipment.\n\n The guidelines were ignored by overseas branches of Indian banks. They failed to share any document/information with PNB, which was made available to them by the firms at the time of availing credit from them.\n\n When did Mehul Choksi leave India?\n\n Choksi fled the country in January 2018 to Antigua and Barbuda, few days before the PNB scam was uncovered.\n\n Investigating agencies have registered several cases against him and have attached several thousand crores worth of properties till now. Government authorities are trying to get him extradited to India.\n\n. What is extradition?\n\n The extradition process enables governments to bring fugitives who have fled their country to justice. It typically is enabled by a bilateral or multilateral treaty. Some states will extradite without a treaty, but those cases are rare.\n\n Where is Mehul Choksi right now?\n\n Mehul Choksi is currently in Dominica. In May-end, 2021, Choksi went missing from Antigua and Barbuda. He was reportedly captured in Dominica while he was trying to flee to Cuba in a boat. A Caribbean court stayed his repatriation from the Dominican Republic.\n\n"], ["", "https://www.outlookindia.com/business/mehul-choksi-how-pnb-scam-turned-a-diamond-merchant-into-india-s-top-wilful-defaulter-news-247017", "", "Jan 9, 2023", "Mehul Choksi: How PNB Scam Turned A Diamond Merchant Into India’s Top Wilful Defaulter Fugitive diamantaire Mehul Choksi, who defaulted on loans worth Rs 7,848 crore, tops the list of India's biggest wilful defaulters. The Parliament was informed on Tuesday that the top 50 wilful defaulters collectively owed about Rs 92,570 crore to Indian banks as of March 31, 2022. Fugitive diamantaire Mehul Choksi, who defaulted on loans worth Rs 7,848 crore, tops this ignoble list.  Mehul Choksi, who is originally from Gujarat, is infamous for the Punjab National Bank (PNB) scam in which the public sector bank was defrauded of close to Rs 13,500 crore. He allegedly masterminded the scam in which his nephew Nirav Modi is also an accused. The siphoning of funds only came to light in 2018, about 8 years after the Choksi-led Gitanjali Gems started defrauding PNB. Choksi has fled the country since then and is currently a ‘wilful defaulter’ who is wanted by Indian authorities such as the Enforcement Directorate (ED) and the Central Bureau of Investigation (CBI).  A wilful defaulter is a borrower who has the ability to make the necessary repayments to the lender but refuses to do that. So, how exactly did Choksi defraud PNB, India’s second largest government-owned bank, and many other financial institutions? \n\nChoksi’s Cheat Codes \n\nGitanjali Group, a retail jewellery firm with around 4,000 stores in India, is at the centre of the PNB scam. With the complicity of some staff members at the public sector bank, Choksi’s Gitanjali Gems initiated a series of transactions at PNB from 2011 onwards that were not recorded in the bank’s Core Banking Software (CBS).  \n\n Further, around 165 Letters of Undertaking (LoU) were fraudulently issued to Choksi’s companies. An LoU is a guarantee issued by a bank that allows the bank’s customer to raise short term credit from a foreign branch of another Indian bank. The fraud lies in the fact that there were no securities kept in places before the LoUs were issued to Choksi’s companies.  \n\n In addition to the fraudulent LoUs, hundreds of Foreign Letters of Credit (FLC) were also issued, out of which many were extremely overvalued. An FLC is another form of short-term credit used for international trade. Even here, Choksi was able to raise money even though he was not credit worthy for the same.  \n\n PNB was not the only victim of Choksi’s payment defaults. Gitanjali Gems defaulted on repayments for loans availed from Life Insurance Corporation of India (LIC), ICICI Bank and IDBI Bank as well. Choksi’s jewellery business was also found to violate several rules of the Foreign Exchange Management Act (FEMA).  \n\n Antigua, As Anticipated \n\n. It is very likely that Choksi knew beforehand that he would be caught. Before details of the PNB scam could fully emerge, Choksi and his family fled the country in January 2018. They arrived in Antigua and Barbuda just days before PNB registered a formal complaint with the CBI.  \n\nHere, it is notable that Choksi had applied for citizenship in the Carribean country in May 2017 itself. This shows how the diamantaire had no intentions of repaying the loans and that fleeing after defaulting was a planned move. The current slew of cases registered against Choksi include criminal conspiracy, criminal breach of trust, cheating, dishonesty, corruption, and money laundering. The CBI had managed to get the Interpol to issue Red Notice against Choksi and India has been attempting to get him extradited since he became an economic fugitive. \n\nElusive Extraditions? \n\n In the latest development, the CBI registered three more cases against Choksi last week. The charges include fraud, inflation of sales figures and illegal diversion of loan funds. Despite the large number of cases, Choksi remains an elusive economic offender. \n\n He is in the company of other fugitive offenders such as his nephew Nirav Modi and the former beer baron Vijay Mallya. Together, the three of them owe around Rs 22,000 crore to banks in India. There was some respite in the fact that earlier this year, the central government informed the Supreme Court that Rs 18,000 crore has been recovered from assets that belonged to Mallya, Modi and Choksi. As of now, attached assets of these three stand at Rs 19,312.20 crore. Out of this, Rs 15,113 crore have been restituted to the public sector banks.\n\n However, economic offenders like Choksi deserve to face the law for the crimes they have committed. As things stand, there is a possibility that some of these offenders may be successfully extradited. For that, India has to continue exerting diplomatic pressure on the offenders’ present havens."], ["", "https://www.hindustantimes.com/cities/mumbai-news/mumbai-mehul-choksi-s-wife-seeks-cancellation-of-warrant-in-pnb-fraud-case-claims-unawareness-of-proceedings-101692731789140.html", "", "Aug 23, 2023", "PNB fraud: Mehul Choksi’s wife moves court seeking cancellation of warrant\n\n Aug 23, 2023 12:46 AM IST\n\n Mehul Choksi's wife, Preeti Kothari, has moved the special PMLA court seeking cancellation of the warrant issued against her in connection with the PNB fraud. Kothari claimed she was unaware of the proceedings and never received any summons.\n\n MUMBAI: Fugitive diamond trader Mehul Choksi’s wife Preeti Kothari on Tuesday moved the special Prevention of Money Laundering Act (PMLA) court seeking cancellation of the warrant issued against her in connection with the ₹13,850-crore Punjab National Bank (PNB) fraud. Kothari claimed that she was unaware of the criminal proceedings against her.\n\n Kothari was named as an accused by the Enforcement Directorate (ED) in its third prosecution complaint (chargesheet) alleging that she was the ultimate beneficial owner of three companies, including Hillingdon Holdings Ltd and Charing Cross Holdings Ltd registered in the United Arab Emirates (UAE). Hillingdon was incorporated by Preeti and one Dion Lillywhite (an employee of a US-based Gitanjali Group company and dummy director in some of the group companies) and the sole shareholder of M/s Goldhawk DMCC (previously named Diminico DMCC).\n\n Based on the ED complaint, the special court had in June last year issued summons to her. The ED had, after a year of issuance of the summons, moved a plea seeking a bailable warrant against Kothari. The agency pleaded that the copy of summons was pasted at her last known address in India, but she did not appear before the court.\n\n Refuting the contentions, Kothari in her plea filed through lawyers Vijay Agrawal and Rahul Agrawal claimed that she was not aware of the proceedings and never received any summons from the agency.\n\n The present applicant was unaware about the existence of the present legal proceedings on account of the fact that she has been a resident of Antigua and Barbuda since she shifted to the country in 2018, much prior to the registration of the enforcement case \n\n information report (ECIR) in the present matter by the ED. The factum of foreign citizenship of the present Applicant, and place of residence being outside India was well known to the Indian authorities, her plea said.\n\n She has also referred to the proceedings initiated by her after the alleged abduction of her husband Mehul Choksi from Antigua in July 2021 and his subsequent arrest in Dominica for alleged illegal entry.\n\n She claimed that the agency did not follow proper procedure to serve summons to her and added that the applicant could not have been expected to have had knowledge of the proceedings presently underway before this Hon’ble Court.\n\n The alleged non-compliance of the summons on the part of the applicant herein was neither wilful, nor deliberate. Furthermore, there can be no presumption of wilful disobedience on the part of the applicant herein, since she was never in receipt of the summons, Kothari said while seeking to cancel the warrant.\n\n Mehul Choksi is the prime accused in the PNB fraud. The CBI investigation has revealed that the bank had reported a fraud amounting to ₹7,080.86 crore in respect of Choksi’s Gitanjali group of companies. The entities controlled by Choksi were also enjoying credit exposure from a consortium of 32 banks and these banks have reported outstanding balance with respect to those entities to the tune of ₹5,099.74 crore as of December 31, 2017.\n\n Choksi’s nephew Nirav Modi has been booked in a separate case for allegedly duping PNB to the tune of ₹66,805.24 crore.\n\n"], ["", "https://www.legalserviceindia.com/legal/article-6613-mehul-choksi-a-renegade.html", "", "Sep 22, 2023", "Mehul Choksi: A Renegade\n\nBy Archita yadav | Views 7380\n\nThis paper contains the details of the case of Mehul Choksi, a fugitive businessman of India. He has been charged with various offences including Punjab national Bank Fraud Case, Money-Laundering Case and others. This paper deals with the case of PNB scam of Rs.13,500 crores. It also deals with the controversies related to his return to India.\n\n Introduction:\n\n Mehul Choksi, a fugitive Indian businessman, was born in Bombay in 1959. He has completed his education from G. D. Modi College in Palanpur, Gujarat. He has three children. He started his career in gems and jewellery sector in 1975 and thereafter inherited his father's business. He is the owner of Gitanjali Groups having about 4000 branches all over India.\n\n Punjab National Bank- Fraud Case:\n\n The PMLA Special Court in March 2018 made an arrested of Choksi and his nephews Nirav Modi and Nishal Modi. It is said that they have entered into a comatose state, with the PNB bank officials who cheated the bank of more than Rs.14,000 crore. It is said to be a hoax-it is the largest bank scam in the history of India.\n\n The officials of the PNB branch, Brady's House in Forte of Mumbai furnished and supplied fake, Letters of Undertakings (LoUs). They were opened in favour of the branches of Indian bank in order to import the gems, for a period of one year, for which, the Reserve Bank of India (RBI) has already provided the guidelines for a total period of 90 days from the date of shipment.\n\nThese recommendations were ignored by the foreign branches of Indian banks. They failed to showcase any document or information to PNB which was given to them while crediting loan by the firms.\n\nAccording to CBI reports, Mehul Choksi and his nephew Nirav Modi had used the loopholes of the banks to make profits out of it. Some of the employees were also involved with them in the same.\n\nFurther, he had been involved in money laundering as per the reports of Enforcement \n\nDirectorate (ED). Mehul Choksi has been booked under the Prevention of Money Laundering Act and other sections pertaining to cheating, criminal conspiracy of the Indian Penal Code and other relevant sections of the Prevention of Corruption Act.\n\nHe had not shown before the investigators for the purpose of investigation. He had given reasons for the same such as his health condition is not good, he has been suffering from diabetes and other health issues. On July 10, 2018, Mehul Choksi was declared a fugitive under the newly introduced Fugitive Economic Offenders Ordinance on demand of an application by Enforcement Directorate.\n\nMehul Choksi has fled India in 2018 before the news of the scam became public. He went to Antigua and Barbuda where he had acquired citizenship under the Citizenship by Investment Programme. Thereafter, he had went missing on May 25 and found in the island of Dominica. The ministry of national security and home affairs of Dominica has declared him prohibited immigrant. It has also ordered the police to remove Mehul Choksi from the territory of Dominica.\n\nDominica Court:\n\nMehul Choksi has filed a bail petition in the court of Dominica for bail and an affidavit as well claiming that he is a law-abiding citizen and he should be allowed to return to Antigua. He also claimed that he would not leave Antigua till further notice. But the court has rejected the bail. His lawyer put forward that Mehul Choksi had not come to Dominica with his free will but was kidnapped. He had attended the court proceedings on the wheelchair as he was unable to walk.\n\nHe also claimed that he was admitted in a hospital due to his poor health conditions. Therefore, according to Section 6 of Dominica's Passport and Immigration Act, he is not a prohibited immigrant, therefore he has not committed any offence and cannot be arrested. He further alleged that Mehul Choksi was not presented before the magistrate within 72 hours as per the law of Dominica.\n\nA habeas corpus petition has been filed on behalf of Mehul Choksi in Dominica High Court for his illegal detention.\n\nThe ministry has sent him a separate notice as well informing that he is not allowed to enter Dominica and that police have been ordered to take requisite steps to expritrate.\n\n Mehul Choksi Return To India:\n\n Several Indian agencies were in touch with the government of Dominica using diplomatic channels urging that he is an Indian citizen and that he had an Interpol Red Corner notice Interpol describes an RN as a request to law enforcement worldwide to locate and provisionally arrest a person pending extradition, surrender, or similar legal action[1] and he should be given back over to the Indian authorities.\n\nThe opposition parties United Workers' Party of Dominica and United Progressive Party of Antigua and Barbuda are in support of him against his deportation to India, in return for campaign funding. Antiguan Information Minister Melford Nicholas has declared that he has ordered to rescind his citizenship of Antigua as he has provided the Government with false information. Choksi has challenged the same in the court.\n\nOn 6 June, Prime Minister of Antigua and Barbuda Mr. Browne said that India sent a private jet to Dominica carrying important documents related to the deportation of fugitive businessman Mehul Choksi to India. He further alleged that he has asked Dominica to hand over Choksi to India directly. The Qatar Airways' private jet has been sent from India to bring back Mehul Choksi from Dominica but there is no news of him returning to India.\n\nConclusion:\n\nAccording to the Ministry of External Affairs, Mehul Choksi will remain be in Dominica as a case is going on in the Dominica Court against him. The next hearing of the case is expected to be on 1st July, 2021. As per the reports, India is making all the possible efforts to bring back fugitive to India to face justice. Further, Antigua PM Gaston Browne has stated that Choksi should be return to India directly from Dominica otherwise it would create problem for Antigua and Barbuda.\n\nEnd-Notes:\n\nWhat is an Interpol Red Notice, what does it do? available at https://indianexpress.com/article/explained/explained-what-is-an-interpol-red-notice-what-does-it-do-5956571/\n\n"], ["", "https://indianexpress.com/article/cities/mumbai/bombay-hc-mehul-choksi-enforcement-directorate-fugitive-economic-offender-8949630/", "", "Sep 22, 2023", "PNB scam case: Bombay HC dismisses Mehul Choksi’s pleas against ED’s application to declare him Fugitive Economic Offender\n\nThe multi-crore fraud was allegedly perpetrated by billionaire jeweller Nirav Modi and his uncle Mehul Choksi, the promoter of Gitanjali Gems. Choksi and Modi have been accused of getting letters of undertaking (LoU) and foreign letters of credit (FLC) of Rs 12,636 crore issued in favour of foreign branches of Indian banks based on fraudulent claims.\n\nMumbai | Updated: September 22, 2023 00:49 IST\n\nThe Bombay High Court Thursday rejected pleas by Mehul Choksi, an accused in the PNB scam case, challenging pending applications of the Enforcement Directorate (ED) before the Special Court to declare him as a Fugitive Economic Offender (FEO).\n\nThe multi-crore fraud was allegedly perpetrated by billionaire jeweller Nirav Modi and his uncle Mehul Choksi, the promoter of Gitanjali Gems. Choksi and Modi have been accused of getting letters of undertaking (LoU) and foreign letters of credit (FLC) of Rs 12,636 crore issued in favour of foreign branches of Indian banks based on fraudulent claims.\n\nNirav Modi was declared FEO by a special court in December 2019 and the extradition process against him is underway.\n\nA single-judge bench of Justice Sarang V Kotwal had on September 11 concluded a hearing in Choksi’s pleas and reserved its order. The HC was hearing four pleas filed by Choksi claiming alleged procedural lapses in the proceedings before the special court designated under the Prevention of Money Laundering Act (PMLA).\n\nThe HC had first granted interim relief to Choksi in January 2020 by restraining the special court from pronouncing its final order in the ED’s application seeking to declare Choksi as an FEO and the same was continued from time to time till Thursday, which the bench vacated through its verdict.\n\nIn 2019, the ED had moved an application before the PMLA Court to declare Choksi an FEO under the Fugitive Economic Offenders Act, 2018, and also to confiscate his properties. As per the 2018 law, a person can be declared FEO if a warrant has been issued against him for an offence involving an amount of Rs 100 crore or more and if the person has left the country and refuses to return.\n\nChoksi had then moved the HC to challenge the ED’s application, filing two pleas including one seeking dismissal of the central agency’s application and the other seeking permission to cross-examine the investigating officers and persons on whose statements the probing agency relied to declare Choksi an FEO.\n\nChoksi’s lawyer had approached the High Court alleging procedural flaws in the ED affidavit filed before the special court.\n\nLast month, the agency had also approached the High Court seeking to review the HC’s stay on the proceedings to declare Choksi as FEO.\n\nThe central agency claimed that Choksi is an accused under the PMLA Act and prosecution against him is pending due to the stay granted by the HC. It had argued that after three years, the matter ought to be heard afresh. However, the special judge was not doing so due to interim relief granted by the HC, therefore it urged Justice Kotwal to finally decide the pleas at the earliest.\n\nAdvocate Vijay Aggarwal, appearing for Choksi, had raised an objection to the ED’s stand that the interim order of the High Court was granted without any reason and it had indirectly stayed the extradition proceedings against the said accused.\n\nAfter Justice Kotwal expressed displeasure over the ED’s casual” comment, the agency withdrew the same.\n\n"]]